particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
        // Wait for last SPI transfer finished
        while (isBusy()) {
            ;
        }

        AtomicSection lk;

        // TODO: delete: we don't use SPI interrupt
        InterruptDis(SPI_DEV_TABLE[spiInterface_].IrqNum);
        InterruptUnRegister(SPI_DEV_TABLE[spiInterface_].IrqNum);
        SSI_INTConfig(SPI_DEV_TABLE[spiInterface_].SPIx, (BIT_IMR_RXFIM | BIT_IMR_RXOIM | BIT_IMR_RXUIM), DISABLE);
        SSI_INTConfig(SPI_DEV_TABLE[spiInterface_].SPIx, (BIT_IMR_TXOIM | BIT_IMR_TXEIM), DISABLE);
        SSI_Cmd(SPI_DEV_TABLE[spiInterface_].SPIx, DISABLE);

        /* Set SSI DMA Disable */
        SSI_SetDmaEnable(SPI_DEV_TABLE[spiInterface_].SPIx, DISABLE, BIT_SHIFT_DMACR_RDMAE);
        SSI_SetDmaEnable(SPI_DEV_TABLE[spiInterface_].SPIx, DISABLE, BIT_SHIFT_DMACR_TDMAE);

        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);

        /* Clear Pending ISR */
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        GDMA_ChnlFree(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ChnlFree(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);

        // Set GPIO and pin function
        hal_gpio_mode(sclkPin_, INPUT_PULLUP);
        hal_gpio_mode(mosiPin_, PIN_MODE_NONE);
        hal_gpio_mode(misoPin_, PIN_MODE_NONE);
        hal_pin_set_function(sclkPin_, PF_NONE);
        hal_pin_set_function(mosiPin_, PF_NONE);
        hal_pin_set_function(misoPin_, PF_NONE);

        // Update state
        status_.state = HAL_SPI_STATE_DISABLED;
        status_.transferredLength = 0;

        return SYSTEM_ERROR_NONE;
    }

    int lock(system_tick_t timeout = 0) {
        CHECK_TRUE(hal_interrupt_is_isr() == false, SYSTEM_ERROR_INVALID_STATE);
        // FIXME: os_mutex_recursive_lock doesn't take any arguments, using trylock for now
        if (timeout) {
            return os_mutex_recursive_lock(mutex_);
        }

        return os_mutex_recursive_trylock(mutex_);
    }

    int unlock() {
        CHECK_TRUE(hal_interrupt_is_isr() == false, SYSTEM_ERROR_INVALID_STATE);
        return os_mutex_recursive_unlock(mutex_);
    }

    uint8_t transfer(uint8_t data) {
        CHECK_TRUE(isEnabled(), 0);
        CHECK_TRUE(isBusy() == false, 0);
        CHECK_TRUE(config_.spiMode == SPI_MODE_MASTER, 0);

        // Wait for last SPI transfer finished
        while (isBusy()) {
            ;
        }

        // //LOG_DEBUG(INFO, "+++transfer(data): 0x%x", SSI_Readable(SPI_DEV_TABLE[spiInterface_].SPIx));

        // Wait until SPI is writeable
        while (!SSI_Writeable(SPI_DEV_TABLE[spiInterface_].SPIx)) {
            ;
        }
        SSI_WriteData(SPI_DEV_TABLE[spiInterface_].SPIx, data);

        // Wait until SPI is readable
        while (!SSI_Readable(SPI_DEV_TABLE[spiInterface_].SPIx)) {
            ;
        }

        // //LOG_DEBUG(INFO, "---transfer(data): 0x%x", SSI_Readable(SPI_DEV_TABLE[spiInterface_].SPIx));

        return (uint8_t)SSI_ReadData(SPI_DEV_TABLE[spiInterface_].SPIx);
    }


    // Return bytes to be received
    // size_t rxChunk() {
    //     AtomicSection lk;

    //     CHECK_TRUE(status_.receiving == false, 0);

    //     return 0;
    // }

    __attribute__(( optimize("-O0") )) void startTransmission() {
        AtomicSection lk;

        if (status_.transmitting) {
            return;
        }

        if (chunkBuffer_.txIndex >= bufferConfig_.txLength) {
            // NOTE: dmaUserCb is called in receiver interrupt
            // //LOG_DEBUG(INFO, "startTransmission finished! sent length: %d", chunkBuffer_.txIndex);

            // if (bufferConfig_.txBuf) {
            //     LOG_PRINTF(INFO, "tx: %d, ", chunkBuffer_.txIndex);
            //     LOG_DUMP(INFO, (void*)bufferConfig_.txBuf, chunkBuffer_.txIndex);
            //     LOG_PRINTF(INFO, "\r\n");
            // }

            chunkBuffer_.txIndex = 0;
            return;
        }

        chunkBuffer_.txLength = std::min(bufferConfig_.txLength - chunkBuffer_.txIndex, (size_t)CFG_CHUNK_BUF_SIZE);
        DCache_Invalidate((u32) bufferConfig_.txBuf, bufferConfig_.txLength);
        if (bufferConfig_.txBuf) {
            memcpy(chunkBuffer_.txBuf, (void*)&bufferConfig_.txBuf[chunkBuffer_.txIndex], chunkBuffer_.txLength);
        } else {
            memset(chunkBuffer_.txBuf, 0xFF, chunkBuffer_.txLength);
        }
        DCache_Invalidate((u32) chunkBuffer_.txBuf, chunkBuffer_.txLength);
        //LOG_DEBUG(INFO, "start to send new chunk, curr index: %d, length: %d", chunkBuffer_.txIndex, chunkBuffer_.txLength);
        if (((chunkBuffer_.txLength & 0x03)==0) && (((u32)(chunkBuffer_.txBuf) & 0x03)==0)) {
            /*  4-bytes aligned, move 4 bytes each transfer */
            txDmaInitStruct_.GDMA_SrcMsize   = MsizeOne;
            txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthFourBytes;
            txDmaInitStruct_.GDMA_BlockSize = chunkBuffer_.txLength >> 2;
        } else {
            txDmaInitStruct_.GDMA_SrcMsize   = MsizeFour;
            txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthOneByte;
            txDmaInitStruct_.GDMA_BlockSize = chunkBuffer_.txLength;
        }
        txDmaInitStruct_.GDMA_DstMsize  = MsizeFour;
        txDmaInitStruct_.GDMA_DstDataWidth =  TrWidthOneByte;
        assert_param(txDmaInitStruct_.GDMA_BlockSize <= 4096);
        txDmaInitStruct_.GDMA_SrcAddr = (u32)chunkBuffer_.txBuf;

        /*  Enable GDMA for TX */
        GDMA_Init(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, &txDmaInitStruct_);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, ENABLE);
        status_.transmitting = true;
    }

    void startReceiver() {
        AtomicSection lk;

        if (status_.receiving) {
            return;
        }

        // Update transferred data length
        status_.transferredLength = chunkBuffer_.rxIndex;

        if (chunkBuffer_.rxIndex >= bufferConfig_.rxLength) {
            // LOG_PRINTF(INFO, "rx: %d, ", chunkBuffer_.rxIndex);
            // LOG_DUMP(INFO, (void*)bufferConfig_.rxBuf, chunkBuffer_.rxIndex);
            // LOG_PRINTF(INFO, "\r\n");

            chunkBuffer_.rxIndex = 0;

            if (config_.spiMode == SPI_MODE_MASTER) {
                // FIXME: For SPI slave, the user callback will be called after CS pin is pulled high.
                if (callbackConfig_.dmaUserCb) {
                    (*callbackConfig_.dmaUserCb)();
                }
                status_.userDmaCbHandled = true;
            }
            return;
        }

        if (config_.spiMode == SPI_MODE_MASTER) {
            chunkBuffer_.rxLength = std::min(bufferConfig_.rxLength - chunkBuffer_.rxIndex, (size_t)CFG_CHUNK_BUF_SIZE);
        } else {
            // FIXME: For SPI slave, the dma buffer cannot be less than 4 bytes, otherwise spi slave receives nothing
            //        when the master sends less than 4bytes data.
            //        If the user uses Non-four-byte alignment buffer, the user callback will be called after CS pin is pulled high.
            chunkBuffer_.rxLength = CFG_CHUNK_BUF_SIZE;
        }

