particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
        //LOG_DEBUG(INFO, "start to receive new chunk, index: %d, length: %d", chunkBuffer_.rxIndex, chunkBuffer_.rxLength);

        //  8~4 bits mode
        rxDmaInitStruct_.GDMA_SrcMsize = MsizeFour;
        rxDmaInitStruct_.GDMA_SrcDataWidth = TrWidthOneByte;
        rxDmaInitStruct_.GDMA_BlockSize = chunkBuffer_.rxLength;
        if (((chunkBuffer_.rxLength & 0x03)==0) && (((u32)(chunkBuffer_.rxBuf) & 0x03)==0)) {
            /*  4-bytes aligned, move 4 bytes each transfer */
            rxDmaInitStruct_.GDMA_DstMsize = MsizeOne;
            rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthFourBytes;
        } else {
            rxDmaInitStruct_.GDMA_DstMsize = MsizeFour;
            rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthOneByte;
        }
        assert_param(rxDmaInitStruct_.GDMA_BlockSize <= 4096);
        rxDmaInitStruct_.GDMA_DstAddr = (u32)chunkBuffer_.rxBuf;

        /*  Enable GDMA for RX */
        GDMA_Init(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, &rxDmaInitStruct_);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, ENABLE);
        status_.receiving = true;
    }

    int stopTransfer() {
        AtomicSection lk;

        if (!status_.transmitting && !status_.receiving) {
            return SYSTEM_ERROR_INVALID_STATE;
        }

        // Clear Pending ISR, free RX DMA resource
        // GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        // uint32_t dmaStopAddress = GDMA_GetDstAddr(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        if (status_.receiving) {
            uint32_t dmaStopAddress = GDMA_GetDstAddr(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
            size_t dmaRxCount = dmaStopAddress ? (dmaStopAddress - (uint32_t)chunkBuffer_.rxBuf) : 0;
            size_t fifoRxCount = 0;
            size_t bytesToCopy = 0;
            if (dmaRxCount < chunkBuffer_.rxLength) {
                fifoRxCount = SSI_ReceiveData(SPI_DEV_TABLE[spiInterface_].SPIx, &chunkBuffer_.rxBuf[dmaRxCount], chunkBuffer_.rxLength - dmaRxCount);
                bytesToCopy = std::min(bufferConfig_.rxLength - chunkBuffer_.rxIndex, dmaRxCount + fifoRxCount);
                    DCache_Invalidate((u32) chunkBuffer_.rxBuf, chunkBuffer_.rxLength);
                    memcpy((void*)&bufferConfig_.rxBuf[chunkBuffer_.rxIndex], (void*)chunkBuffer_.rxBuf, bytesToCopy);
                    DCache_Invalidate((u32) bufferConfig_.rxBuf, bufferConfig_.rxLength);
                chunkBuffer_.rxIndex += bytesToCopy;

            } else {
                //LOG_DEBUG(ERROR, "dmaStopAddress is not reliable.");
            }

            status_.transferredLength = chunkBuffer_.rxIndex;
            // //LOG_DEBUG(INFO, "stopTransfer, status_.receiving: %d, transferredLength:  %d, dmaStopAddress: 0x%x, chunkBuffer_.rxBuf: 0x%x", 
            //     status_.receiving, status_.transferredLength, dmaStopAddress, chunkBuffer_.rxBuf);
            //LOG_DEBUG(INFO, "dmaRxCount: %ld, fifoRxCount: %ld, bytesToCopy: %ld", dmaRxCount, fifoRxCount, bytesToCopy);
            // LOG_PRINTF(INFO, "rx: %d, ", chunkBuffer_.rxIndex);
            // LOG_DUMP(INFO, (void*)bufferConfig_.rxBuf, chunkBuffer_.rxIndex);
            // LOG_PRINTF(INFO, "\r\n");
        }

        // TX data has been moved to DMA peripheral, force to clean it
        // Clear Pending ISR, free TX DMA resource
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        status_.transmitting = false;
        chunkBuffer_.txIndex = 0;

        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        status_.receiving = false;
        chunkBuffer_.rxIndex = 0;

        return SYSTEM_ERROR_NONE;
    }

    int transferDma(const uint8_t* txBuf, uint8_t* rxBuf, size_t size, hal_spi_dma_user_callback callback) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        // Wait for last SPI master transfer finished
        while ((config_.spiMode == SPI_MODE_MASTER) && isBusy()) {
            ;
        }

        AtomicSection lk;

        // Reset SPI in case the data in the buffer is not read completely in the last transfer
        transferDmaCancel();
        SSI_Cmd(SPI_DEV_TABLE[spiInterface_].SPIx, DISABLE);
        SSI_Cmd(SPI_DEV_TABLE[spiInterface_].SPIx, ENABLE);

        bufferConfig_.rxBuf = rxBuf;
        bufferConfig_.rxLength = size;
        bufferConfig_.txBuf = txBuf;
        bufferConfig_.txLength = size;

        callbackConfig_.dmaUserCb = callback;
        status_.configuredTransferLength = size;
        status_.transferredLength = 0;

        //LOG_DEBUG(INFO, "transferDma, buffer length: %ld!!!", size);

        chunkBuffer_.txIndex = 0;
        chunkBuffer_.rxIndex = 0;

        startTransmission();
        startReceiver();

        return SYSTEM_ERROR_NONE;
    }

    int transferDmaCancel() {
        AtomicSection lk;

        // //LOG_DEBUG(INFO, "transferDmaCancel!");
        /* Disable interrupt */
        // SSI_INTConfig(SPI_DEV_TABLE[spiInterface_].SPIx, (BIT_IMR_RXFIM | BIT_IMR_RXOIM | BIT_IMR_RXUIM), DISABLE);
        // SSI_INTConfig(SPI_DEV_TABLE[spiInterface_].SPIx, (BIT_IMR_TXOIM | BIT_IMR_TXEIM), DISABLE);

        /* Clear Pending ISR */
        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        status_.transmitting = false;
        status_.receiving = false;
        callbackConfig_.dmaUserCb = nullptr;

        // Flush fifo
        u32 rxFifoLevel;
        while (SSI_Readable(SPI_DEV_TABLE[spiInterface_].SPIx)) {
            rxFifoLevel = SSI_GetRxCount(SPI_DEV_TABLE[spiInterface_].SPIx);
            for (u32 i = 0; i < rxFifoLevel; i++) {
                SSI_ReadData(SPI_DEV_TABLE[spiInterface_].SPIx);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    SpiConfig config() const {
        return config_;
    }

    int setConfig(SpiConfig& config) {
        CHECK_TRUE(validateConfig(spiInterface_, config), SYSTEM_ERROR_INVALID_ARGUMENT);
        memcpy(&config_, &config, sizeof(SpiConfig));
        return SYSTEM_ERROR_NONE;
    }

