particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
    SpiStatus status() const {
        return status_;
    }

    hal_pin_t csPin() const {
        return csPin_;
    }

    bool isEnabled() const {
        return status_.state == HAL_SPI_STATE_ENABLED;
    }

    bool isBusy() const {
        return status_.transmitting || status_.receiving;
    }

    bool isSuspended() const {
        return status_.state == HAL_SPI_STATE_SUSPENDED;
    }

    bool isDmaBufferConfigured() const {
        // Use at least one buffer for SPI transfer
        return bufferConfig_.txBuf || bufferConfig_.rxBuf;
    }

    int registerSelectUserCb(hal_spi_select_user_callback callback) {
        callbackConfig_.selectUserCb = callback;
        return SYSTEM_ERROR_NONE;
    }

    void interruptHandlerImpl() {
        u32 interruptStatus = SSI_GetIsr(SPI_DEV_TABLE[spiInterface_].SPIx);
        SSI_SetIsrClean(SPI_DEV_TABLE[spiInterface_].SPIx, interruptStatus);

        // TXE: If the master initiates a transfer to the SPI slave when no data exists in the transmit FIFO,
        //      an error flag (TXE) is set in the SPI status register
        //LOG_DEBUG(INFO, "[int] spi int: 0x%08x", interruptStatus);

        if (interruptStatus & (BIT_ISR_TXOIS | BIT_ISR_RXUIS | BIT_ISR_RXOIS | BIT_ISR_MSTIS)) {
            //LOG_DEBUG(WARN, "SPI error 0x%08x", interruptStatus);
        }
    }

    void dmaTxHandlerImpl() {
        // Clear Pending ISR, free TX DMA resource
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        uint32_t isrTypeMap = GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        (void)isrTypeMap;
        status_.transmitting = false;

        chunkBuffer_.txIndex += chunkBuffer_.txLength;
        //LOG_DEBUG(INFO, "[int] spi dma tx done! isr: 0x%x, index: %d", isrTypeMap, chunkBuffer_.txIndex);
    
        startTransmission();
    }

    void dmaRxHandlerImpl() {
        // Clear Pending ISR, free RX DMA resource
        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        status_.receiving = false;

        /// Transfer in progress
        uint32_t copyLength = 0;
        copyLength = std::min(bufferConfig_.rxLength - chunkBuffer_.rxIndex, chunkBuffer_.rxLength);
        if (bufferConfig_.rxBuf) {
            DCache_Invalidate((u32) chunkBuffer_.rxBuf, chunkBuffer_.rxLength);
            memcpy((void*)&bufferConfig_.rxBuf[chunkBuffer_.rxIndex], chunkBuffer_.rxBuf, copyLength);
            DCache_Invalidate((u32) bufferConfig_.rxBuf, bufferConfig_.rxLength);
        }
        chunkBuffer_.rxIndex += copyLength;
        //LOG_DEBUG(INFO, "[int] spi dma rx done! index: %d, copyLength: %d", chunkBuffer_.rxIndex, copyLength);

        startReceiver();
    }

    void onSelectedHandlerImpl() {
        status_.csPinSelected = !hal_gpio_read(csPin_);
        //LOG_DEBUG(INFO, "[GPIO int] cs selected: %d %s", status_.csPinSelected, status_.csPinSelected ? "+++++++" : "------");
        if (callbackConfig_.selectUserCb) {
            (*callbackConfig_.selectUserCb)(status_.csPinSelected);
        }

        if (isDmaBufferConfigured()) {
            if (status_.csPinSelected) {
                status_.userDmaCbHandled = false;
                SSI_Cmd(SPI_DEV_TABLE[spiInterface_].SPIx, ENABLE);

                // Releaod DMA buffer
                startTransmission();
                startReceiver();
            } else {
                stopTransfer();
                SSI_Cmd(SPI_DEV_TABLE[spiInterface_].SPIx, DISABLE);
                if (status_.userDmaCbHandled == false) {
                    // SPI master sends the data that is less than the buffer size in the SPI slave
                    if (callbackConfig_.dmaUserCb) {
                        (*callbackConfig_.dmaUserCb)();
                    }
                }
            }
        }
    }

    static bool validateConfig(hal_spi_interface_t spi, const SpiConfig& config) {
        CHECK_TRUE(config.spiMode == SPI_MODE_MASTER ||
                   config.spiMode == SPI_MODE_SLAVE, false);
        CHECK_TRUE(config.dataMode == SPI_MODE0 ||
                   config.dataMode == SPI_MODE1 ||
                   config.dataMode == SPI_MODE2 ||
                   config.dataMode == SPI_MODE3, false);
        CHECK_TRUE(config.bitOrder == MSBFIRST ||
                   config.bitOrder == LSBFIRST, false);
        // SPI0 can work as master and slave while SPI1 can only work as slave.
        CHECK_FALSE(spi == HAL_SPI_INTERFACE2 && config.spiMode == SPI_MODE_SLAVE, false);
        return true;
    }

    static uint32_t interruptHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->interruptHandlerImpl();
        return SYSTEM_ERROR_NONE;
    }

    static u32 dmaTxHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->dmaTxHandlerImpl();
        return 0;
    }

    static u32 dmaRxHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->dmaRxHandlerImpl();
        return 0;
    }

    static void onSelectedHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->onSelectedHandlerImpl();
    }

private:
    int initDmaChannels() {
        uint8_t txGdmaChannel = GDMA_ChnlAlloc(0, dmaTxHandler, (uint32_t)this, CFG_GDMA_TX_PRIORITY);
        if (txGdmaChannel == 0xFF) {
            return SYSTEM_ERROR_INTERNAL;
        }
        uint8_t rxGdmaChannel = GDMA_ChnlAlloc(0, dmaRxHandler, (uint32_t)this, CFG_GDMA_RX_PRIORITY);
        if (rxGdmaChannel == 0xFF) {
            GDMA_ChnlFree(0, txGdmaChannel);
            return SYSTEM_ERROR_INTERNAL;
        }

        _memset(&txDmaInitStruct_, 0, sizeof(GDMA_InitTypeDef));
        txDmaInitStruct_.GDMA_DIR = TTFCMemToPeri;
        txDmaInitStruct_.GDMA_DstHandshakeInterface = SPI_DEV_TABLE[spiInterface_].Tx_HandshakeInterface;
        txDmaInitStruct_.GDMA_DstAddr = (u32)&SPI_DEV_TABLE[spiInterface_].SPIx->DR;
        txDmaInitStruct_.GDMA_Index = 0;
        txDmaInitStruct_.GDMA_ChNum = txGdmaChannel;
        txDmaInitStruct_.GDMA_IsrType = (BlockType|TransferType|ErrType);
        txDmaInitStruct_.GDMA_SrcMsize = MsizeOne;
        txDmaInitStruct_.GDMA_DstMsize = MsizeFour;
        txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthFourBytes;
        txDmaInitStruct_.GDMA_DstDataWidth = TrWidthOneByte;
        txDmaInitStruct_.GDMA_DstInc = NoChange;
        txDmaInitStruct_.GDMA_SrcInc = IncType;

        _memset(&rxDmaInitStruct_, 0, sizeof(GDMA_InitTypeDef));
        rxDmaInitStruct_.GDMA_DIR = TTFCPeriToMem;
        rxDmaInitStruct_.GDMA_ReloadSrc = 0;
        rxDmaInitStruct_.GDMA_SrcHandshakeInterface = SPI_DEV_TABLE[spiInterface_].Rx_HandshakeInterface;
        rxDmaInitStruct_.GDMA_SrcAddr = (u32)&SPI_DEV_TABLE[spiInterface_].SPIx->DR;
        rxDmaInitStruct_.GDMA_Index = 0;
        rxDmaInitStruct_.GDMA_ChNum = rxGdmaChannel;
        rxDmaInitStruct_.GDMA_IsrType = (BlockType|TransferType|ErrType);
        rxDmaInitStruct_.GDMA_SrcMsize = MsizeEight;
        rxDmaInitStruct_.GDMA_DstMsize = MsizeFour;
        rxDmaInitStruct_.GDMA_SrcDataWidth = TrWidthTwoBytes;
        rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthFourBytes;
        rxDmaInitStruct_.GDMA_DstInc = IncType;
        rxDmaInitStruct_.GDMA_SrcInc = NoChange;

        NVIC_SetPriority(GDMA_GetIrqNum(0, txDmaInitStruct_.GDMA_ChNum), CFG_GDMA_TX_PRIORITY);
        NVIC_SetPriority(GDMA_GetIrqNum(0, rxDmaInitStruct_.GDMA_ChNum), CFG_GDMA_RX_PRIORITY);

        return SYSTEM_ERROR_NONE;
    }

